# IFC_GetNumPsets

## Description
Gets the number of property sets, attached to the object

```pascal
FUNCTION IFC_GetNumPsets(
				hObject         : HANDLE;
				VAR outNumPsets : INTEGER) : BOOLEAN;
```

```python

def vs.IFC_GetNumPsets(hObject):
    return (BOOLEAN, outNumPsets)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|outNumPsets|INTEGER||

## Version
Availability: from Vectorworks 2014
## Category
* IFC